000100951012     A* ********************************************************
000200951012     A* DIH ALLOWANCES ALLOCATION MASTER FILE                  *
000300951012     A*   S. BRITTON                                           *
000400981119     A*           FILENAME = ALWMFL01           19/11/98       *
000500951012     A**********************************************************
000600981119     A          R ALWREC                    PFILE(ALWMF)
000800981119     A          K ALWGRD
000900981123     A          K ALWTYP
001000981119     A          S ALWSTS                    COMP(EQ 'A')
