000100951012     A* ********************************************************
000200981119     A* DIH ALLOWANCES TYPE MASTER FILE                        *
000300951012     A*   S. BRITTON                                           *
000400981119     A*           FILENAME = ALWTFL01           19/11/98       *
000500951012     A**********************************************************
000600981119     A          R ALTREC                    PFILE(ALWTF)
000700981119     A          K ALTTYP
000800981119     A          S ALTSTS                    COMP(EQ 'A')
