000100941113     A* ********************************************************
000200980115     A* DIH LIABILITY MASTER FILE                              *
000300941226     A*                                                        *
000400971230     A*                                         19971230       *
000500980115     A*                           SAMUEL BRITTON               *
000600941113     A**********************************************************
000700980115     A          R LIFMT                     PFILE(LIABM)
000701020206     A          K LITYPE
000702990129     A          K LIEMP
