000100941113     A* ********************************************************
000200980115     A* DIH LIABILITY MASTER FILE                              *
000300941226     A*                                                        *
000400971230     A*                                         19971230       *
000500980115     A*                           SAMUEL BRITTON               *
000600941113     A**********************************************************
000700980218     A          R LIFMT                     JFILE(EMPMAST LIABM)
000800980218     A          J                           JOIN(1 2)
000900980218     A                                      JFLD(EMP LIEMP)
001000980218     A            EMP
001100980218     A            CLASS
001200980219     A            SURNAM
001300980219     A            CHRIST
001400980219     A            GRADE                     SST(CLASS 3 1)
001500980218     A            LIEMP
001600980218     A            LITYPE
001700980218     A            LISTYP
001800980218     A            LICODE
001900980218     A            LIFIX
002000980218     A            LIAMT01
002100980218     A            LIAMT02
002200980218     A            LIAMT03
002300980218     A            LIAMT04
002400980218     A            LIAMT05
002500980218     A            LIAMT06
002600980218     A            LIAMT07
002700980218     A            LIAMT08
002800980218     A            LIAMT09
002900980218     A            LIAMT10
003000980218     A            LIAMT11
003100980218     A            LIAMT12
003200980219     A          K GRADE                     DESCEND
003300980218     A          K EMP
