000100941113     A* ********************************************************
000200980117     A* DIH LIABILITY TRANSACTION FILE                         *
000300941226     A*                                                        *
000400971230     A*                                         19971230       *
000500971230     A*                           CHRIS WILLIAMS               *
000600941113     A**********************************************************
000700971230     A          R LTFMT                     PFILE(LIABT)
000800980117     A          K LTEMP
