000100951012     A* ********************************************************
000200010504     A* EMOLUMENTS ALLOCATION MASTER FILE (EMPLOYEE)           *
000300010430     A*   S. BRITTON, C. WILLIAMS                              *
000400010504     A*           FILENAME = PAYALWTL01         30/04/2001     *
000500951012     A**********************************************************
000600010504     A          R ALTFMT                    PFILE(PAYALWTF)
000700010504     A          K ALTTYP
000800010504     A          K ALTEMP
