000100010411     A          R PCRSFMT                   PFILE(PAYCROSS)
000200010418     A          K PCRSTYPE
000300020206     A          K PCRSSTYPE
000400010412     A          S PCRSSTS                   COMP(EQ 'A')
