000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010913     A          K PHISTYPE
000300010918     A          K PHISNDATE
