000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010902     A          K PHISEMP
000300010902     A          K PHISPRNO
000400011228     A          K PHISNDATE
