000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010924     A          K PHISPRNO
000300010924     A          K PHISEMP
000400010924     A          K PHISTYPE
000500020107     A          K PHISNDATE
