000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200050422     A*         K PHISDIV
000300050422     A*         K PHISTYPE
000400050422     A*         K PHISDEPT
000500050422     A          K PHISEMP
000600011012     A          K PHISNDATE
