000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010902     A          K PHISEMP
000300041027     A          K PHISTYPE
000400041106     A          K PHISNDATE
