000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010902     A          K PHISPRNO
000300010913     A          K PHISTYPE
000400030509     A          K PHISNDATE
000500131029     A          K PHISWCATE
