000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200011006     A          K PHISNDATE
000300010903     A          K PHISDEPT
000400010903     A          K PHISTYPE
000500010907     A          K PHISEMP
