000100010423     A          R PHISFMT                   PFILE(PAYHIS)
000200010920     A          K PHISNDATE
000300010424     A          K PHISTYPE
000400010427     A          K PHISEMP
000500131112     A*         K PHISWCATE
