000100080221     A          R PNISFMT                   PFILE(PAYNISRDAT)
000200080221     A          K PNREMP
000300080221     A          K PNRPRNO
000400080221     A          K PNRTYPE
000500080221     A          K PNRNDATE
