000100010426     A          R PRDFFMT                   PFILE(PAYRDEF)
000200010723     A          K PRDFTYPE
000300010426     A          K PRDFPTYPE
000400010426     A          S PRDFSTS                   VALUES('A')
