000100010423     A          R PTISFMT                   PFILE(PAYTRANS)
000200010907     A          K PTRNPDATE
000300010806     A          K PTRNTYPE
000400010423     A          K PTRNTCODE
000500010907     A          K PTRNEMP
