000100010423     A          R PTISFMT                   PFILE(PAYTRANS)
000200011001     A          K PTRNNDATE
000300010806     A          K PTRNTYPE
000400010423     A          K PTRNTCODE
000500010907     A          K PTRNEMP
000600131029     A          K PTRNWCATE
