000100941113     A* ********************************************************
000200950725     A* DIH EMPLOYEE XMAS BONUS INFORMATION - BY DEPARTMENT    *
000300950705     A*   S. BRITTON                                           *
000400950725     A*           FILENAME = XMSBONL1           22/07/95       *
000500950705     A**********************************************************
000600020530     A          R XMSREC                    PFILE(XMSBONF)
000700950725     A          K DEPT
000800950725     A          K EMP
