000010960127     A*%%TS  SD  19960127  130726  SAMMY       REL-V2R3M0  5738-PW1
000020960127     A*%%EC
000030960127     A                                      DSPSIZ(24 80 *DS3)
000040960127     A          R FMT1
000050960127     A*%%TS  SD  19960127  130726  SAMMY       REL-V2R3M0  5738-PW1
000060960127     A                                      CF03(03)
000070960127     A                                  7  1'Enter Number'
000080960127     A            AMOUNT        11Y 2B  7 16EDTWRD('         .  ')
000090960127     A            TEXT         100A  O 10  2
