000010021005     A*%%TS  SD  20021005  113335  SBRITTON    REL-V5R1M0  5722-WDS
000020021005     A*%%EC
000030021005     A                                      DSPSIZ(24 80 *DS3)
000040021005     A                                      CF03(03)
000050021005     A          R FMT1
000060021005     A*%%TS  SD  20021005  113335  SBRITTON    REL-V5R1M0  5722-WDS
000070021005     A                                      CA01(01)
000080021005     A                                  2  3USER
000090021005     A                                      DSPATR(HI)
000100021005     A                                  1 71SYSNAME
000110021005     A                                      DSPATR(HI)
000120021005     A            @PGM          10A  O  1  3DSPATR(HI)
000130021005     A            CONAME        30A  O  1 26DSPATR(HI)
000140021005     A                                      DSPATR(UL)
000150021005     A            @TITLE        40A  O  2 21DSPATR(HI)
000160021005     A                                 23 37'F3 = End'
000170021005     A                                      DSPATR(HI)
000180021005     A            @DATE         10A  O  2 69DSPATR(HI)
000190021005     A            ERRMSG        75A  O 24  3DSPATR(HI)
000200021005     A                                  7 26'1. System Parameters'
000210021005     A                                      COLOR(BLU)
000220021005     A            OPTION         1D 0I 14 26DSPATR(HI)
000230021005     A                                 14 30'<- Enter Selection'
000240021005     A                                  8 26'2. User Authority Setup'
000250021005     A                                      COLOR(BLU)
000260021005     A                                  9 26'3. Savings Configuration'
000270021005     A                                      COLOR(BLU)
