000010980205     A*%%TS  SD  19980205  182135  SAMMY       REL-V3R2M0  5763-PW1
000020980205     A*%%EC
000030980205     A                                      DSPSIZ(24 80 *DS3)
000040980205     A          R KCONFIRM
000050980205     A*%%TS  SD  19980205  182135  SAMMY       REL-V3R2M0  5763-PW1
000060980205     A                                      CF21(21)
000070980205     A                                      WINDOW(10 10 5 50)
000080980205     A                                  2  2'PRESS F21 TO CONFIRM PROCESSING'
000090980205     A                                  3 18'or'
000100980205     A                                  4 14'......... ENTER TO CANCEL'
