000010110531     A*%%TS  SD  20110531  101126  CWILLIAMS   REL-V7R1M0  5770-WDS
000020110531     A*%%EC
000030110531     A                                      DSPSIZ(24 80 *DS3)
000040960416     A          R RECORD
000050960416     A*%%TS  SD  19960416  104623  ANTHONY     REL-V3R1M0  5763-PW1
000060960416     A                                      ASSUME
000070960416     A                                  1  4' '
000080110531     A          R SFDSP                     SFL
000090110531     A*%%TS  SD  20110531  101126  CWILLIAMS   REL-V7R1M0  5770-WDS
000100110531     A            OPT            1A  I  5  4
000110110531     A  99                                  DSPATR(ND)
000120110531     A  99                                  DSPATR(PR)
000130110531     A            KTERMG    R        O  5 22REFFLD(KTGREC/KTERMG *LIBL/KRONTF)
000140110531     A                                      DSPATR(HI)
000150110531     A            KTERMID   R        O  5 10REFFLD(KTGREC/KTERMID *LIBL/KRONTF)
000160110531     A                                      DSPATR(HI)
000170110531     A          R SFCTL                     SFLCTL(SFDSP)
000180110531     A*%%TS  SD  20110531  101126  CWILLIAMS   REL-V7R1M0  5770-WDS
000190110531     A                                      SFLSIZ(0050)
000200110531     A                                      SFLPAG(0009)
000210110531     A                                      WINDOW(5 10 15 50)
000220110531     A N25                                  SFLDSP
000230110531     A                                      SFLDSPCTL
000240110531     A  12                                  SFLCLR
000250110531     A N20                                  SFLEND(*MORE)
000260110531     A N99                              3  2'Select'
000270110531     A                                      DSPATR(UL)
000280110531     A N99                              4  3'(x)'
000290110531     A                                  2 15'Kronos Terminal Groups'
000300110531     A                                      DSPATR(UL)
000310110531     A                                  3 23'Terminal Names'
000320110531     A                                      DSPATR(UL)
000330110531     A                                  3 10'ID'
000340110531     A                                      DSPATR(UL)
000350110531     A            CONAME        30   O  1 11DSPATR(HI)
000360110531     A                                      DSPATR(UL)
