000010110531     A*%%TS  SD  20110531  103145  CWILLIAMS   REL-V7R1M0  5770-WDS
000020110531     A*%%EC
000030110531     A                                      DSPSIZ(24 80 *DS3)
000040960416     A          R RECORD
000050960416     A*%%TS  SD  19960416  083206  SAMMY       REL-V3R1M0  5763-PW1
000060960416     A                                      ASSUME
000070960416     A                                  1  4' '
000080960502     A          R SFDSP                     SFL
000090960502     A*%%TS  SD  19960502  093624  SAMMY       REL-V3R1M0  5763-PW1
000100110531     A            KSCHDE    R        O  5 21REFFLD(KSPREC/KSCHDE  *LIBL/KRONSF)
000110960502     A                                      TEXT('Kronos Schdeule Names')
000120960502     A            OPT            1A  I  5  4
000130960502     A  99                                  DSPATR(ND)
000140960502     A  99                                  DSPATR(PR)
000150110531     A          R SFCTL                     SFLCTL(SFDSP)
000160110531     A*%%TS  SD  20110531  103145  CWILLIAMS   REL-V7R1M0  5770-WDS
000170110531     A                                      SFLSIZ(0050)
000180110531     A                                      SFLPAG(0009)
000190110531     A                                      WINDOW(5 10 15 50)
000200110531     A N25                                  SFLDSP
000210110531     A                                      SFLDSPCTL
000220110531     A  12                                  SFLCLR
000230110531     A N20                                  SFLEND(*MORE)
000240110531     A                                  2 16'Kronos Schdeule Names'
000250110531     A                                      DSPATR(UL)
000260110531     A N99                              3  2'Select'
000270110531     A                                      DSPATR(UL)
000280110531     A N99                              4  3'(x)'
000290110531     A                                  3 21'Names'
000300110531     A                                      DSPATR(UL)
000310110531     A            CONAME        30   O  1 11DSPATR(UL)
000320110531     A                                      DSPATR(HI)
