000010990209     A*%%TS  SD  19990209  171606  SAMMY       REL-V3R7M0  5716-PW1
000020941122     A*
000030990209     A*%%EC
000040990209     A                                      DSPSIZ(24 80 *DS3)
000050990209     A                                      CA03(03)
000060941120     A*
000070970104     A          R FMT1
000080970104     A*%%TS  SD  19970104  161421  SAMMY       REL-V3R1M0  5763-PW1
000090970104     A            UDATE          6Y 0O  1  2EDTCDE(Y)
000100970104     A            @USER         10A  O  2  2
000110970104     A                                  1 24'B A N K S   D I H    L T D'
000120970104     A                                  2 21'DIH DIVISIONS FILE  MAINTENANCE'
000130970104     A                                      DSPATR(UL)
000140970104     A            #MODE          6A  O  1 75DSPATR(RI)
000150970104     A            @PGM          10A  O  2 70
000160970104     A                                  4  4'Division No..'
000170970104     A            DTNO           2Y 0B  4 22EDTCDE(Z)
000180970104     A                                 23  1'CMD3=End Program'
000190970104     A                                      DSPATR(HI)
000200941120     A**
000210990209     A          R FMT2
000220990209     A*%%TS  SD  19990209  171606  SAMMY       REL-V3R7M0  5716-PW1
000230990209     A                                      CA01(01)
000240990209     A            UDATE          6Y 0O  1  2EDTCDE(Y)
000250990209     A            @USER         10A  O  2  2
000260990209     A                                  1 24'B A N K S   D I H    L T D'
000270990209     A                                  2 21'DIH DIVISIONS FILE  MAINTENANCE'
000280990209     A                                      DSPATR(UL)
000290990209     A            #MODE          6A  O  1 75DSPATR(RI)
000300990209     A            @PGM          10A  O  2 70
000310990209     A                                  4  4'Division No.....'
000320990209     A            DTNO           2Y 0O  4 22EDTCDE(Z)
000330990209     A                                      DSPATR(HI)
000340990209     A                                  6  4'Division Name...'
000350990209     A            DTNAME        15A  B  6 22CHECK(LC)
000360990209     A                                 23  2'CMD1=Cancel   CMD3=End Program'
000370990209     A                                      DSPATR(HI)
000380990209     A            DTBNK          3A  B  8 22
000390990209     A  10                                  ERRMSG('Invalid Bank Code')
000400990209     A  11                                  ERRMSG('Cannot duplicate Bank code -
000410990209     A                                      from another location')
000420990209     A  12                                  ERRMSG('Cannot remove - this Bank i-
000430990209     A                                      s currently being used')
000440990209     A                                  8  4'Bank Code.......'
000450990209     A                                  8 30'(Optional)'
000460990209     A            DTFLAG         1A  B 10 22
000470990209     A  10                                  ERRMSG('Invalid Bank Code')
000480990209     A                                      CHECK(AB)
000490990209     A                                      COMP(EQ 'Y')
000500990209     A                                 10 30'(Optional)'
000510990209     A                                 10  4'Bank Flag.......'
