000010030126     A*%%TS  SD  20030126  195503  SBRITTON    REL-V5R2M0  5722-WDS
000020030126     A*%%EC
000030030126     A                                      DSPSIZ(24 80 *DS3)
000040030126     A                                      CF03(03)
000050021031     A          R FMT1
000060021031     A*%%TS  SD  20021031  170120  SBRITTON    REL-V5R1M0  5722-WDS
000070021031     A                                  5 14'Employee Number =>'
000080021031     A                                      COLOR(BLU)
000090021031     A                                  2  2USER
000100021031     A                                      DSPATR(HI)
000110021031     A                                 23 33'F3 = End Program'
000120021031     A                                      DSPATR(HI)
000130021031     A            EMP       R        B  5 35REFFLD(EMPRREC/EMP PAYLIB/EMPREF)
000140021031     A                                      EDTCDE(4)
000150021031     A                                  1 72SYSNAME
000160021031     A                                      DSPATR(HI)
000170021031     A            @PGM          10A  O  1  2DSPATR(HI)
000180021031     A            CONAME        30A  O  1 26DSPATR(HI)
000190021031     A                                      DSPATR(UL)
000200021031     A            @TITLE        40A  O  2 21DSPATR(HI)
000210021031     A            @DATE         10A  O  2 70DSPATR(HI)
000220021031     A            ERRMSG        75A  O 24  3DSPATR(HI)
000230021031     A            YEAR           4Y 0B  7 35EDTCDE(4)
000240021031     A                                  7 21'... Year =>'
000250021031     A                                      COLOR(BLU)
000260030126     A          R SFLREC                    SFL
000270030126     A*%%TS  SD  20030126  195503  SBRITTON    REL-V5R2M0  5722-WDS
000280030126     A            YTDTYP#        2S 0H
000290030126     A            PTYDESC   R        O 10  3REFFLD(PTYFMT/PTYDESC PAYLIB/PAYTYP)
000300030126     A                                      COLOR(BLU)
000310030126     A            CHGAMT    R        B 10 43REFFLD(YTDREC/YTDAMT *LIBL/PAYEYTD)
000320030126     A                                      EDTCDE(1)
000330030126     A  88                                  DSPATR(PR)
000340030126     A            YTDAMT#       13S 2H
000350030126     A                                 10 29'->'
000360030126     A N99                                  COLOR(BLU)
000370030126     A  99                                  COLOR(RED)
000380030126     A            YTDORG#        3A  H
000390030126     A            NEWYTD    R        O 10 64REFFLD(YTDREC/YTDAMT *LIBL/PAYEYTD)
000400030126     A                                      EDTCDE(1)
000410030126     A                                      DSPATR(HI)
000420030126     A            SEL            1A  B 10 35CHECK(AB)
000430030126     A                                      VALUES('+' '-' 'C')
000440030126     A            YTDOPT#        2S 0H
000450030126     A            TYPE_FLAG      1   H
000460021031     A          R SFLCTL                    SFLCTL(SFLREC)
000470021031     A*%%TS  SD  20021031  185121  SBRITTON    REL-V5R1M0  5722-WDS
000480021031     A                                      SFLSIZ(0099)
000490021031     A                                      SFLPAG(0006)
000500021031     A                                      CF05(05)
000510021031     A                                      CF15(15)
000520021031     A                                      OVERLAY
000530021031     A                                      PROTECT
000540021031     A  75                                  SFLDSP
000550021031     A                                      SFLDSPCTL
000560021031     A  33                                  SFLCLR
000570021031     A  55                                  SFLEND(*MORE)
000580021031     A            @PGM          10A  O  1  3DSPATR(HI)
000590021031     A                                  2  3USER
000600021031     A                                      DSPATR(HI)
000610021031     A            CONAME        30A  O  1 26DSPATR(HI)
000620021031     A                                      DSPATR(UL)
000630021031     A            @TITLE        40A  O  2 21DSPATR(HI)
000640021031     A            @DATE         10A  O  2 69DSPATR(HI)
000650021031     A                                  5  4'Employee ==>'
000660021031     A                                      COLOR(BLU)
000670021031     A                                  1 71SYSNAME
000680021031     A                                      DSPATR(HI)
000690021031     A                                  9 68'New Amount'
000700021031     A                                      DSPATR(UL)
000710021031     A                                      DSPATR(HI)
000720021031     A                                  9 32'(+,-,C)'
000730021031     A                                      DSPATR(HI)
000740021031     A                                      DSPATR(UL)
000750021031     A            EMP            6Y 0O  5 18EDTCDE(Z)
000760021031     A                                      DSPATR(HI)
000770021031     A                                      TEXT('EMP#')
000780021031     A            EMP_NAME      40A  O  5 27DSPATR(HI)
000790021031     A                                  9  4'Description'
000800021031     A                                      DSPATR(HI)
000810021031     A                                      DSPATR(UL)
000820021031     A                                  6  4'Year ======>'
000830021031     A                                      COLOR(BLU)
000840021031     A            YEAR           4Y 0O  6 18EDTCDE(Z)
000850021031     A                                      DSPATR(HI)
000860021031     A                                      TEXT('EMP#')
000870021031     A                                  9 44'Change Amount'
000880021031     A                                      DSPATR(UL)
000890021031     A                                      DSPATR(HI)
000900021031     A          R FOOTER
000910021031     A*%%TS  SD  20021031  174720  SBRITTON    REL-V5R1M0  5722-WDS
000920021031     A                                      SLNO(08)
000930021031     A                                      CLRL(*NO)
000940021031     A                                      OVERLAY
000950021031     A                                 12  4'Note:  Use + sign to add changes t-
000960021031     A                                      o current YTD figures,'
000970021031     A                                      COLOR(BLU)
000980021031     A                                 13 11'- sign to subtract changes from cu-
000990021031     A                                      rrent YTD figures or'
001000021031     A                                      COLOR(BLU)
001010021031     A                                 14 11'letter C  to completely replace cu-
001020021031     A                                      rrent figures with '
001030021031     A                                      COLOR(BLU)
001040021031     A                                 15 11'the Changes amount.'
001050021031     A                                      COLOR(BLU)
001060021031     A                                 17 60'F15 = Confirm'
001070021031     A                                      COLOR(RED)
001080021031     A                                      DSPATR(RI)
001090021031     A                                 17  6'F3 = End Program'
001100021031     A                                      DSPATR(HI)
001110021031     A                                 17 29'F5 = Refresh Data'
001120021031     A                                      DSPATR(HI)
