000010121119     A*%%TS  SD  20121119  161736  CWILLIAMS   REL-V7R1M0  5770-WDS
000020121119     A*%%EC
000030030828     A*%%FD Payroll Electronic data transfer
000040121119     A                                      DSPSIZ(24 80 *DS3)
000050121119     A                                      CF03(03)
000060090908     A          R FMT1
000070090908     A*%%TS  SD  20090908  110341  SBRITTON    REL-V6R1M0  5761-WDS
000080090908     A                                  2  3USER
000090090908     A                                      DSPATR(HI)
000100090908     A                                  1 71SYSNAME
000110090908     A                                      DSPATR(HI)
000120090908     A            @PGM          10A  O  1  3DSPATR(HI)
000130090908     A            CONAME        30A  O  1 26DSPATR(HI)
000140090908     A                                      DSPATR(UL)
000150090908     A            @TITLE        40A  O  2 21DSPATR(HI)
000160090908     A                                 23 33'F3 = End Program'
000170090908     A                                      DSPATR(HI)
000180090908     A            @DATE         10A  O  2 69DSPATR(HI)
000190090908     A                                 13  6'Enter your choice .........'
000200090908     A                                      COLOR(BLU)
000210090908     A            ERRMSG        75A  O 24  3COLOR(RED)
000220090908     A                                 11 42'1. Setup Bank/Govt. Inst. params'
000230090908     A                                 12 42'2. Process Transactions'
000240090908     A            OPTION         1Y 0B 13 38DSPATR(HI)
000250090908     A                                      EDTCDE(Z)
000260030828     A*%%GP SCREEN1    01
000270121119     A          R FMT2
000280121119     A*%%TS  SD  20121119  161736  CWILLIAMS   REL-V7R1M0  5770-WDS
000290121119     A                                      CA02(02)
000300121119     A                                  2  3USER
000310121119     A                                      DSPATR(HI)
000320121119     A                                  1 71SYSNAME
000330121119     A                                      DSPATR(HI)
000340121119     A            @PGM          10A  O  1  3DSPATR(HI)
000350121119     A            CONAME        30A  O  1 26DSPATR(HI)
000360121119     A                                      DSPATR(UL)
000370121119     A            @TITLE        40A  O  2 21DSPATR(HI)
000380121119     A            @DATE         10A  O  2 69DSPATR(HI)
000390121119     A                                  6 49'1. Citizen''s bank'
000400121119     A                                 13 16'Select Bank...........'
000410121119     A                                      COLOR(BLU)
000420121119     A            BANKSEL        2Y 0B 13 44DSPATR(HI)
000430121119     A                                      EDTCDE(Z)
000440121119     A                                  7 49'2. Republic bank'
000450121119     A            ERRMSG        75A  O 24  3COLOR(RED)
000460121119     A                                 23  5'F2 =  Go back'
000470121119     A                                      DSPATR(HI)
000480030828     A*%%GP SCREEN2    01
000490121119     A                                  8 49'3. ScotiaBank'
000500121119     A                                  9 49'4. Demerara Bank'
000510121119     A                                 12 49'6. N.I.S'
000520121119     A                                 13 49'7. Guyana Revenue Authority'
000530121119     A                                 11 49'----------------------------'
000540121119     A                                 10 49'5. G.B.T.I'
000550090107     A          R FMT3
000560090107     A*%%TS  SD  20090107  154036  SBRITTON    REL-V6R1M0  5761-WDS
000570090107     A                                      CA02(02)
000580090107     A                                      CA07(07)
000590090107     A                                      CA04(04)
000600090107     A                                      RTNCSRLOC(*RECNAME &REC &FLD)
000610090107     A                                  2  3USER
000620090107     A                                      DSPATR(HI)
000630090107     A                                  1 71SYSNAME
000640090107     A                                      DSPATR(HI)
000650090107     A            @PGM          10A  O  1  3DSPATR(HI)
000660090107     A            CONAME        30A  O  1 26DSPATR(HI)
000670090107     A                                      DSPATR(UL)
000680090107     A            @TITLE        40A  O  2 21DSPATR(HI)
000690090107     A            @DATE         10A  O  2 69DSPATR(HI)
000700090107     A                                  4  3'Select Bank....'
000710090107     A                                      COLOR(BLU)
000720090107     A                                  6  3'List Payment Divisions...'
000730090107     A                                      COLOR(BLU)
000740090107     A            BANKSEL        2S 0O  4 31DSPATR(HI)
000750090107     A                                  8  3'Specify Account No.......'
000760090107     A                                      COLOR(BLU)
000770090107     A            PEACCT        25A  B  8 31
000780090107     A                                  9  3'Batch no/seq. range......'
000790090107     A                                      COLOR(BLU)
000800090107     A            PEDIV         10Y 0B  6 31EDTWRD('  -  -  -  -  ')
000810090107     A            PELOWER        6Y 0B  9 31EDTCDE(Z)
000820090107     A                                  9 38'-'
000830090107     A                                      COLOR(BLU)
000840090107     A                                      DSPATR(HI)
000850090107     A            PEUPPER        6Y 0B  9 40EDTCDE(Z)
000860090107     A            ERRMSG        75A  O 24  3COLOR(RED)
000870090107     A                                 23  5'F2 = Go Back'
000880090107     A                                      DSPATR(HI)
000890030828     A*%%GP SCREEN4    01
000900090107     A                                 23 21'F4 = Prompt for Maint.'
000910090107     A                                      DSPATR(HI)
000920030828     A*%%GP SCREEN4    01
000930090107     A                                 10  3'Transaction charges......'
000940090107     A                                      COLOR(BLU)
000950090107     A            PECHGAMT#      5Y 2B 10 31EDTCDE(1)
000960090107     A                                 11  3'Default Charge account...'
000970090107     A                                      COLOR(BLU)
000980090107     A            PEDFTCHGAC     7Y 0B 11 31EDTCDE(Z)
000990090107     A                                 12  3'Default clearing account.'
001000090107     A                                      COLOR(BLU)
001010090107     A            PEDFTCLAC      7Y 0B 12 31EDTCDE(Z)
001020090107     A                                 13  3'Default Transit no.......'
001030090107     A                                      COLOR(BLU)
001040090107     A            PEDFTTRN#      8Y 0B 13 31EDTCDE(Z)
001050090107     A                                 14 18'Specify ONLY for email Setup'
001060090107     A                                      DSPATR(HI)
001070090107     A                                 17  3'Text Document File Name..'
001080090107     A                                      COLOR(BLU)
001090090107     A            PEFILENM#    100A  B 17 29ALIAS(FILE_NAME)
001100090107     A                                      CHECK(LC)
001110090107     A                                 19  3'Email Subject............'
001120090107     A                                      COLOR(BLU)
001130090107     A            PESUBJECT#    50A  B 19 29ALIAS(TRANS_SUBJECT)
001140090107     A                                      CHECK(LC)
001150090107     A                                 16  3'Emailed From Address.....'
001160090107     A                                      COLOR(BLU)
001170090107     A            PEMFROM#      50A  B 16 29ALIAS(EMAIL_FROM)
001180090107     A                                      CHECK(LC)
001190090107     A                                 20  3'Email Text...............'
001200090107     A                                      COLOR(BLU)
001210090107     A            PETEXT#       50A  B 20 29CHECK(LC)
001220090107     A                                 22  3'* - Use fields as specified by spe-
001230090107     A                                      cified Bank/Financial Institution'
001240090107     A                                      COLOR(RED)
001250090107     A                                  8 58'*'
001260090107     A                                      COLOR(RED)
001270090107     A                                  9 58'*'
001280090107     A                                      COLOR(RED)
001290090107     A                                 10 58'*'
001300090107     A                                      COLOR(RED)
001310090107     A                                 11 58'*'
001320090107     A                                      COLOR(RED)
001330090107     A                                 12 58'*'
001340090107     A                                      COLOR(RED)
001350090107     A                                 13 58'*'
001360090107     A                                      COLOR(RED)
001370090107     A                                 23 48'F7 = Set-up email List'
001380090107     A                                      DSPATR(HI)
001390090107     A            REC           10A  H
001400090107     A            FLD           10A  H
001410030828     A*%%GP SCREEN4    01
001420081211     A          R FMT4
001430081211     A*%%TS  SD  20081211  192338  SBRITTON    REL-V6R1M0  5761-WDS
001440081211     A                                      CA21(21)
001450081211     A                                  2  3USER
001460081211     A                                      DSPATR(HI)
001470081211     A                                  1 71SYSNAME
001480081211     A                                      DSPATR(HI)
001490081211     A            @PGM          10A  O  1  3DSPATR(HI)
001500081211     A            CONAME        30A  O  1 26DSPATR(HI)
001510081211     A                                      DSPATR(UL)
001520081211     A            @TITLE        40A  O  2 21DSPATR(HI)
001530081211     A            @DATE         10A  O  2 69DSPATR(HI)
001540091014     A          R FMT5
001550091014     A*%%TS  SD  20091014  100453  SBRITTON    REL-V6R1M0  5761-WDS
001560091014     A                                      CA21(21)
001570091014     A                                      FRCDTA
001580091014     A                                      SLNO(20)
001590091014     A                                      OVERLAY
001600091014     A            ERRMSG        75   O  1  3
001610091014     A  99                                  DSPATR(BL)
001620091014     A  99                                  COLOR(RED)
001630091014     A            ERRMSG2       75A  O  2  3
001640091014     A            ERRMSG3       75A  O  3  3
001650091014     A            ERRMSG4       75A  O  4  3
001660030317     A*%%GP SCREEN5    02
001670090618     A          R WINDOW
001680090618     A*%%TS  SD  20090618  164220  SBRITTON    REL-V6R1M0  5761-WDS
001690090618     A                                      WINDOW(5 2 17 75)
001700090619     A          R WINREC                    SFL
001710090619     A*%%TS  SD  20090619  172238  SBRITTON    REL-V6R1M0  5761-WDS
001720090619     A            PAYEMP         6Y 0O  6  1EDTCDE(Z)
001730090619     A            PAYACC        30A  B  6  9
001740090619     A            PAYCRD         6Y 0O  6 41EDTCDE(Y)
001750090619     A            PAYNAME       26A  O  6 50
001760090619     A            OLDPAYACC     30A  H
001770030317     A*%%GP SCREEN5    01
001780090618     A          R WDWCTL                    SFLCTL(WINREC)
001790090618     A*%%TS  SD  20090618  164220  SBRITTON    REL-V6R1M0  5761-WDS
001800090618     A                                      CF05(05)
001810090618     A                                      OVERLAY
001820090618     A                                      SFLDSP
001830090618     A                                      SFLDSPCTL
001840090618     A  33                                  SFLCLR
001850090618     A  55                                  SFLEND(*MORE)
001860090618     A                                      SFLSIZ(0100)
001870090618     A                                      SFLPAG(0010)
001880090618     A                                      WINDOW(WINDOW)
001890090618     A                                      WDWBORDER((*COLOR BLU) (*CHAR '...:-
001900090618     A                                      ::.:'))
001910090618     A                                      RMVWDW
001920090618     A                                  5 50'Name'
001930090618     A                                      DSPATR(UL)
001940090618     A                                      COLOR(BLU)
001950090618     A                                  3 17'F5= Print List'
001960090618     A                                      DSPATR(HI)
001970090618     A                                  1 16'Invalid Account List'
001980090618     A                                      DSPATR(HI)
001990090618     A                                      DSPATR(UL)
002000090618     A                                      COLOR(BLU)
002010090618     A                                  3  3'F3= Exit'
002020090618     A                                      DSPATR(HI)
002030090618     A                                  5 45'Date'
002040090618     A                                      COLOR(BLU)
002050090618     A                                      DSPATR(UL)
002060090618     A                                  5  9'Account No.'
002070090618     A                                      COLOR(BLU)
002080090618     A                                      DSPATR(UL)
002090090618     A                                  5  3'Emp.'
002100090618     A                                      COLOR(BLU)
002110090618     A                                      DSPATR(UL)
