000010970105     A*%%TS  SD  19970105  193724  SAMMY       REL-V3R1M0  5763-PW1
000020970105     A*%%EC
000030970105     A                                      DSPSIZ(24 80 *DS3)
000040970105     A                                      CF03
000050970105     A                                      CF12
000060970105     A                                      ROLLUP(98)
000070970105     A                                      ROLLDOWN(99)
000080941121     A          R SELECT
000090941121     A*%%TS  SD  19941121  125335  SAMMY       REL-V2R3M0  5738-PW1
000100941121     A                                  1 32'BANKS DIH LIMITED'
000110941121     A                                      DSPATR(HI)
000120941121     A                                      DSPATR(UL)
000130941121     A                                  2 33'Selection Screen'
000140941121     A                                      DSPATR(UL)
000150941121     A                                 23 37'F3 - end'
000160941121     A                                  8 32'1. Enter  records'
000170941121     A                                  9 32'2. Change record'
000180941121     A                                 10 32'3. Delete records'
000190941121     A                                 14 20'Enter your choice here:'
000200941121     A            OPTION         1D 0I 14 46CHECK(ER)
000210941121     A                                      RANGE(1 3)
000220960131     A          R BENTRY
000230960131     A*%%TS  SD  19960131  084838  SAMMY       REL-V2R3M0  5738-PW1
000240960131     A                                  1 32'BANKS DIH LIMITED'
000250960131     A                                      DSPATR(HI)
000260960131     A                                      DSPATR(UL)
000270960131     A                                  2 29'Employees Monthly Bonus'
000280960131     A                                      DSPATR(UL)
000290960131     A                                 12  4'Employee number:'
000300960131     A                                 12 37'Total  Bonus ->:'
000310960131     A  11                                  DSPATR(ND)
000320960131     A                                 23 34'F12 - Go back'
000330960131     A                                      DSPATR(HI)
000340960131     A            EMP       R        B 12 23REFFLD(EMP PAYLIB/WAGDIF)
000350960131     A  12                                  DSPATR(PR)
000360960131     A  11                                  CHECK(ER)
000370960131     A                                      EDTCDE(3)
000380960131     A  05                                  ERRMSGID(MSG0001 PAYLIB/PAYMESS)
000390960131     A N08 10                               ERRMSGID(MSG0003 PAYLIB/PAYMESS)
000400960131     A  07                                  ERRMSGID(MSG0004 PAYLIB/PAYMESS)
000410960131     A  06                                  ERRMSGID(MSG0007 PAYLIB/PAYMESS)
000420960131     A            AMOUNT    R        B 12 55REFFLD(AMOUNT PAYLIB/WAGDIF)
000430960131     A  11                                  DSPATR(ND)
000440960131     A                                      EDTCDE(1)
000450960131     A                                 23 57'Rollup/Rolldown'
000460960131     A                                      DSPATR(HI)
