000100020626             PGM
000200000309             MONMSG     MSGID(CPF4328)
000300000309             STRCMTCTL  LCKLVL(*CHG)
000400021115             SETATNPGM  PGM(*PRVINVLVL)
000500010716    /* Payroll Application */
000600010716             CALLPRC    PRC(PAY000R)
000700050615             COMMIT
000800991209             ENDCMTCTL
000900941209             ENDPGM
