000100950710     H DECEDIT('.') DATEDIT(*DMY/)
000200950710     F**
000300950710     F** TO LIST INCENTIVE PAYMENTS.
000400950905     F** PROGRAMMER S.BRITTON
000500950710     FEMPMAL14  IP   E           K DISK
000600950710     FDEPTHRS   IF   E           K DISK
000700950710     FREPORT    O    F  132        PRINTER OFLIND(*INOF)
000800950710     D TABCOD          S              2  0 DIM(12) CTDATA PERRCD(7) ASCEND
000900950710     D TABMTH          S              9    DIM(12) ALT(TABCOD)
001000950710     D TABCD           S              2  0 DIM(12) CTDATA PERRCD(7)
001100950710     D TABPMH          S              9    DIM(12) ALT(TABCD)
001200950710     IEMPREC        01
001300950710     I                                          DEPT          L2
001400950710     I                                          STATUS        L1
001500950721     C**
001600950721     C                   SETOFF                                       020306
001700950721     C**
001800950712     C     UMONTH        LOOKUP    TABCOD        TABMTH                   02
001900950712     C     DEPT          CHAIN     DEPTHRS                            03
002000950712     C     UMONTH        LOOKUP    TABCD         TABPMH                   06
002100950710     C                   MOVE      CLASS         GRADE             1
002200950721     C**
002300981130     C     DEPT          IFLT      98
002400950710     C     DEPT          ANDNE     41
002500950710     C     DEPT          ANDNE     43
002600950710     C     DEPT          ANDNE     44
002700950710     C     DEPT          ANDNE     47
002800950710     C     DEPT          ANDNE     54
002900950710     C     DEPT          ANDNE     50
003000981130     C     DEPT          ANDNE     92
003100970203     C     GRADE         ANDNE     '8'
003200970131     C     GRADE         ANDNE     '9'
003300981216     C     class         ANDNE     ' 9D'
003400950720     C  N77
003500950720     COR OF              EXCEPT    HEDR1
003600950721     C**
003700970124     C     STATUS        COMP      'E'                                    05
003800970124     C  N05STATUS        COMP      'R'                                    07
003900970124     C**
004000950721     C  N78              EXCEPT    HEDR2
004100950712     C     CHRIST        CAT(P)    SURNAM:1      NAME             25
004200970203     C                   SETON                                        7778
004300950720     C                   EXCEPT    DETAIL
004400970124     C                   ENDIF
004500950721     C**
004600950720     CL1                 SETOFF                                       0507
004700950721     CL1 78              EXCEPT    TDETAL
004800950721     CL1                 SETOFF                                       78
004900950721     C**
005000950721     CL2 77              EXCEPT    FDETAL
005100950721     CL2                 SETOFF                                       77
005200950721     OREPORT    E            HEDR1       0  1 03
005300950711     O                                           77 'BANKS   D.I.H   LIMITED'
005400950711     O                                          122 'PAGE'
005500950711     O                       PAGE          Z    126
005600950721     O          E            HEDR1       0  2
005700950711     O                                           77 '-----------------------'
005800950711     O                                          126 '----'
005900950721     O          E            HEDR1       0  1
006000950711     O                                           65 'I N C E N T I V E'
006100950711     O                                           83 'P A Y M E N T S'
006200950721     O          E            HEDR1       0  2
006300950711     O                                           65 '-----------------'
006400950711     O                                           83 '---------------'
006500950721     O          E            HEDR1       0  1
006600950711     O                                           72 'D A T E.'
006700950711     O                  06   TABPMH              86
006800950711     O                                           94 'PAID'
006900950711     O                  02   TABMTH             108
007000950711     O                                          109 ','
007100950711     O                       *YEAR              113
007200950711     O                                          114 '.'
007300950721     O          E            HEDR1       0  2
007400950711     O                                           97 '------------------------'
007500950711     O                                          114 '-----------------'
007600950721     O          E            HEDR1       0  1
007700950711     O                                           31 'DEPARTMENT.'
007800950711     O                 N03   DNAME               73
007900950711     O                                          108 'DEPT. NO.'
008000950711     O                       DEPT          Z    112
008100950721     O          E            HEDR1       0  2
008200950711     O                                           57 '------------------------'
008300940516     O                                           73 '----------------'
008400950711     O                                          111 '---'
008500950721     O          E            HEDR1       0  1
008600950711     O                                           24 '------------------------'
008700950711     O                                           48 '------------------------'
008800950711     O                                           72 '------------------------'
008900950711     O                                           96 '------------------------'
009000950711     O                                          120 '------------------------'
009100950711     O                                          132 '------------'
009200950721     O          E            HEDR1       0  1
009300950711     O                                           42 '|  EMP.  |'
009400950711     O                                           62 '|   PER-  |'
009500950711     O                                           76 'GROSS   |'
009600950711     O                                          101 '|'
009700950711     O                                          126 '|   PAYABLE'
009800950721     O          E            HEDR1       0  1
009900950711     O                                           25 'EMPLOYEE   NAME'
010000950711     O                                           56 '|   NO.  |  GRADE  | CEN'
010100950711     O                                           76 'TAGE |     BONUS   |'
010200950711     O                                          101 'P E N A L T I E S   |'
010300950711     O                                          125 'AWARD    |    BONUS'
010400950721     O          E            HEDR1       0  1
010500950711     O                                           24 '------------------------'
010600950711     O                                           48 '------------------------'
010700950711     O                                           72 '------------------------'
010800950711     O                                           96 '------------------------'
010900950711     O                                          120 '------------------------'
011000950711     O                                          132 '------------'
011100950721     O          E          05HEDR2       0  1
011200950711     O                                           20 'E X E C U T I V E S'
011300950711     O                                           52 '|        |         |'
011400950711     O                                           76 '|             |'
011500950711     O                                          116 '|              |'
011600950721     O          E          05HEDR2       0  1
011700950711     O                                           20 '-------------------'
011800950711     O                                           52 '|        |         |'
011900950711     O                                           76 '|             |'
012000950711     O                                          116 '|              |'
012100950721     O          E            HEDR2       0  1
012200950711     O                                           52 '|        |         |'
012300950711     O                                           76 '|             |'
012400950711     O                                          116 '|              |'
012500950721     O          E          07HEDR2       0  1
012600950720     O                                           16 'R E G U L A R'
012700950721     O          E          07HEDR2       0  2
012800950720     O                                           16 '-------------'
012900950721     O          E            DETAIL      0  1
013000950711     O                       NAME                30
013100950711     O                       EMP           4     39
013200950711     O                       CLASS               47
013300950711     O                                           33 '|'
013400950711     O                                           42 '|'
013500950711     O                                           52 '|'
013600950711     O                                           62 '|'
013700950711     O                                           76 '|'
013800950711     O                                          101 '|'
013900950711     O                                          116 '|'
014000950721     O          E            DETAIL      0  1
014100950711     O                                           56 '|--------|---------|----'
014200950711     O                                           80 '-----|-------------|----'
014300950711     O                                          104 '--------------------|---'
014400950711     O                                          128 '-----------|------------'
014500950711     O                                          132 '----'
014600950721     O          E            TDETAL      0  1
014700950711     O                                           52 '|        |         |'
014800950711     O                                           76 '|             |'
014900950711     O                                          116 '|              |'
015000950721     O          E            TDETAL      0  1
015100950711     O                                           85 '|-------------|---------'
015200950711     O                                          109 '---------------|--------'
015300950711     O                                          132 '------|----------------'
015400950721     O          E            TDETAL      0  1
015500950711     O                                           62 'SUB.  TOTAL    |'
015600950711     O                                           76 '|'
015700950711     O                                          116 '|              |'
015800950711     O                                          130 '**'
015900950721     O          E            TDETAL      0  3
016000950711     O                                           85 '|-------------|---------'
016100950711     O                                          109 '---------------|--------'
016200950711     O                                          132 '------|----------------'
016300950721     O          E            FDETAL      1  1
016400950711     O                                           85 '------------------------'
016500950711     O                                          109 '------------------------'
016600950711     O                                          132 '-----------------------'
016700950721     O          E            FDETAL      0  1
016800950711     O                                           62 'FINAL  TOTAL    |'
016900950711     O                                           76 '|'
017000950711     O                                          116 '               |'
017100950711     O                                          131 '***'
017200950721     O          E            FDETAL      0  3
017300950711     O                                           85 '------------------------'
017400950711     O                                          109 '------------------------'
017500960628     o                                          132 '-----------------------'
017600950721     O          E            FDETAL      1  3
017700950721     O                                           29 'PREPARED  BY. -----'
017800950711     O                                           49 '--------------------'
017900950711     O                                          109 'APPROVED  BY. -----'
018000950711     O                                          129 '--------------------'
018100950721     O          E            FDETAL      1  1
018200950711     O                                           27 '**. ALL  COLUMNS  ARE  T'
018300950711     O                                           51 'O  BE  ADDED  AND  CROSS'
018400950711     O                                           62 'BALANCED'
018500950721     O          E    L2N77   FDETAL
018600950711     O                                           27 '------------------------'
018700950711     O                                           51 '------------------------'
018800950711     O                                           62 '-----------'
018900950710** TABCOD / TABMTH
01900095071001JANUARY  02FEBRUARY 03MARCH    04APRIL    05MAY      06JUNE     07JULY
01910095071008AUGUST   09SEPTEMBER10OCTOBER  11NOVEMBER 12DECEMBER
019200940516** TABCD / TABPMH
01930095071001DECEMBER 02JANUARY  03FEBRUARY 04MARCH    05APRIL    06MAY      07JUNE
01940095071008JULY     09AUGUST   10SEPTEMBER11OCTOBER  12NOVEMBER
