000100951207     H DATEDIT(*DMY)
000101110531     H bnddir('DISDIR') dftactgrp(*no) actgrp(*new)
000200110531      //*****  PROGRAMMER - S. BIRKETT
000300960502     FKRON15D   CF   E             WORKSTN
000400960416     F                                     SFILE(SFDSP:REC)
000500960502     FKRONSF    IF   E           K DISK
000600110531      //
000700951207     D                SDS
000800951207     D  @PRM             *PARMS
000900110531      *
000901110531     D rec             S              4P 0
000902110531      /copy qcpysrc,genPR
000903110531
000904110531     D*--------------------------------------------------
000905110531     D* Procedure name: aainit
000906110531     D* Purpose:
000907110531     D* Returns:
000908110531     D*--------------------------------------------------
000909110531     D aainit          PR
000910110531
000911110531      //
001000951207     C                   MOVE      '0'           *IN
001200110531      //
001300960502     C     *LIKE         DEFINE    KSCHDE        ISCHDE
001400110531      //
001500951207     C     *ENTRY        PLIST
001600960502     C                   PARM                    ISCHDE
001700110531      //
001701110531      /FREE
001800110531       IF @PRM = *ZEROS;
001900110531         *IN99 = *ON;
002000110531       ENDIF;
002001110531
002002110531
002003110531        *in12 = *on;
002004110531        rec = 0;
002005110531       WRITE SFCTL;
002006110531        *in12 = *off;
002007110531
002100110531         aainit();
002101110531
002200110531       SETLL *LOVAL KRONSF;
002601110531
002700110531       READ KSPREC;
002701110531       *IN13 = %EOF;
002800110531       DOW *IN13 = '0';
002801110531
002802110531        rec +=1;
003000110531         WRITE SFDSP;
003001110531         *IN20 = %EOF;
003100110531         READ KSPREC;
003101110531         *IN13 = %EOF;
003200110531       ENDDO;
003201110531           *in25 = rec = 0;
003400110531       EXFMT SFCTL;
003500110531       //
003600110531       IF *IN25 = *OFF;
003700110531         READC SFDSP;
003701110531         *IN16 = %EOF;
003800110531         IF *IN16 = '0'
003900110531         AND OPT = 'X';
003901110531      /END-FREE
004000960502     C                   MOVEL(P)  KSCHDE        ISCHDE
004001110531      /FREE
004100110531         ENDIF;
004200110531       ENDIF;
004300110531       //
004400110531       *INLR = *ON;
004401110531      /END-FREE
004402110531
004403110531     P*--------------------------------------------------
004404110531     P* Procedure name: aainit
004405110531     P* Purpose:
004406110531     P* Returns:
004407110531     P*--------------------------------------------------
004408110531     P aainit          B
004409110531     D aainit          PI
004410110531
004411110531
004412110531      /FREE
004413110531           coname = get_coname;
004414110531       // Your calculation code goes here
004415110531
004416110531      /END-FREE
004417110531     P aainit          E
004418110531
