000100960329     H
000200960329     H******** PROGRAMMER - S.BRITTON         ************
000300971119     Fempanlf   up   e           k disk
000400971119     C     *entry        plist
000500971119     C                   parm                    type              1
000600971119     **
000700971119     C                   move      'C'           anlsts
000800971119     C                   update    anlrec
000900971119     **
